DrDeLaBill/stm8_temperature_sensor/src/utils.c
#include "utils.h"

#include <stdint.h>

#include "stm8s.h"
#include "main.h"


bool wait_event(bool (*condition) (void), uint32_t time)
{
    uint32_t start_time = Global_time;
    while (abs_dif(start_time, Global_time) < time) {
        if (condition()) {
            return TRUE;
        }
    }
    return FALSE;
}

void delay_ms(uint32_t time) 
{
    uint32_t start_time = Global_time; 
    while (abs_dif(start_time, Global_time) < time);
}

uint32_t abs_dif(int32_t first_n, int32_t second_n)
{
    return (int32_t)(((first_n) > (second_n)) ? ((first_n) - (second_n)) : ((second_n) - (first_n)));
}

uint32_t abs(int32_t number)
{
    return (int32_t)(((number) < 0) ? (-1 * (number)) : (number));
}

uint32_t get_clock_freq()
{
  uint32_t clock_frequency = 0;
  uint8_t clock_source;
  uint8_t tmp = 0, presc = 0;
  const uint8_t HSI_div_factor[4] = {1, 2, 4, 8}; /*!< Holds the different HSI Divider factors */
  
  /* Get CLK source. */
  clock_source = (uint8_t)CLK->CMSR;
  
  tmp = (uint8_t)(CLK->CKDIVR & CLK_CKDIVR_HSIDIV);
  tmp = (uint8_t)(tmp >> 3);
  presc = HSI_div_factor[tmp];
  clock_frequency = HSI_VALUE / presc;

  return ((uint32_t)clock_frequency);
}

uint8_t get_crc8(uint8_t* buffer, uint16_t size) {
  uint8_t crc = 0;
  for (uint16_t i = 0; i < size; i++) {
	uint8_t data = buffer[i];
	for (uint16_t j = 8; j > 0; j--) {
	  crc = ((crc ^ data) & 1) ? (crc >> 1) ^ 0x8C : (crc >> 1);
	  data >>= 1;
	}
  }
  return crc;
}